<?php 

/**
 * 秀仙系统 shopxian_release/3.0.0
 * ============================================================================
 * * 版权所有 2017-2018 上海秀仙网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.shopxian.com；
 * ----------------------------------------------------------------------------
 * 本软件只能免费使用  不允许对程序代码以任何形式任何目的再发布或者出售。
 * ============================================================================
 * 作者: 张启全 

 * 时间: 2018-03-17 23:28:31
 */  
return [ 
    'account'=>'ceshizhanghao', 
    'password'=>'请填写你的密码', 
    'type'=>[ 
        'verify_code'=>'您的验证码是：{$code}。请不要把验证码泄露给其他人。如非本人操作，可不用理会！', 
        'register_code'=>'您的手机号：{$mobile}，注册验证码：{$code}，请不要把验证码泄露给其他人。如非本人操作，可不用理会！', 
        'register_succeed'=>'尊敬的用户您已经注册成功，用户名：{$username}，其它信息：{$msg}。感谢您的注册！', 
        'back_pwd_code'=>'您的手机号：{$mobile}，找回密码验证码：{$code}，请不要把验证码泄露给其他人。如非本人操作，可不用理会！' 
    ] 
];